Revit 2027 API
ParameterTypeId.FramingShapeClassification Property
 "Framing Shape"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FramingShapeClassification { get; }
Public Shared ReadOnly Property FramingShapeClassification As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FramingShapeClassification {
	ForgeTypeId^ get ();
}
static member FramingShapeClassification : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace